# -*- coding:utf-8 -*-
# Author:dongdong Liu

"""
数字类型分为三类
1. 整数
2. 浮点数
3. 复数
"""
# ---------------------------------
# 问题1 计算不准确
count = 0.1 + 0.2
print(count)
# 0.30000000000000004

# 问题2 小数点影响循环
s = 0
while s < 1:
    s = s + 0.1
    print(s)
# 0.1
# 0.2
# 0.30000000000000004
# 0.4
# 0.5
# 0.6
# 0.7
# 0.7999999999999999
# 0.8999999999999999
# 0.9999999999999999
# 1.0999999999999999


# 解决问题 Decimal
import decimal
a = decimal.Decimal("0.1")
b = decimal.Decimal("0.2")
print(a + b)
# 0.3

c = decimal.Decimal("0.3")
print(a + b == c)
# True
# -------------------------------

# 科学计数法
x = 0.000005
print(x)
# 5e-06
# -------------------------------

# 复数
z = 1 + 2j
print("实部数值：" + str(z.real))
print("虚部数值：" + str(z.imag))
# 实部数值：1.0
# 虚部数值：2.0
# -------------------------------

# 数值运算
"""
+
-
*
/
//                整除
%                 取余
abs()             绝对值
int()             转整数
float()           转浮点数
complex(re, im)   返回一个复数
c.conjugate()     返回c的共轭复数
divmod(x, y)      返回(x//y, x%y)
pow()             指数
x ** y            指数
"""